app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "grade 1"], ["room_number", 12], ["created_at", "2019-12-15 17:32:35.020482"], ["updated_at", "2019-12-15 17:32:35.020482"]]
---
  def create
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 212], ["updated_at", "2019-12-15 17:47:02.012009"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:room_number, :title))