app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Farshid"], ["last_name", "Zaman"], ["created_at", "2019-12-15 18:25:06.153483"], ["updated_at", "2019-12-15 18:25:06.153483"]]
---
    def create
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Robert"], ["last_name", "Baratheon"], ["updated_at", "2019-12-16 19:43:40.144383"], ["id", 4]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(first_name: params[:student][:first_name],last_name: params[:student][:last_name])